InformationRegisters/РСК_НастройкиМониторингаСрокаЖизниРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_НастройкиМониторингаСрокаЖизниРезерва</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦКГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокЖизни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйВариантОбеспечения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РСК_НастройкиМониторингаСрокаЖизниРезерва/Ext/ManagerModule.bsl
//++ Конарев 26.01.2023  Определет настройки по указанному подразделению
Функция НаборНастроекДляПодразделения(Подразделение) Экспорт 
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РСК_НастройкиМониторингаСрокаЖизниРезерва.ЦКГ КАК ЦКГ,
	|	РСК_НастройкиМониторингаСрокаЖизниРезерва.Категория КАК Категория,
	|	РСК_НастройкиМониторингаСрокаЖизниРезерва.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.РСК_НастройкиМониторингаСрокаЖизниРезерва КАК РСК_НастройкиМониторингаСрокаЖизниРезерва
	|ГДЕ
	|	РСК_НастройкиМониторингаСрокаЖизниРезерва.Подразделение = &Подразделение
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции  

//Определяет приоритет заказа по настройкам мониторинга сроков жизни резерва
Функция ПриоритетЗаказаПоНастройкам(Партнер, Подразделение) Экспорт
	
	ЗаданныеНастройки = НаборНастроекДляПодразделения(Подразделение);     
	
	Для Каждого СтрокаНастройки Из ЗаданныеНастройки Цикл 
				
		Если НЕ ЗначениеЗаполнено(СтрокаНастройки.ЦКГ) И НЕ ЗначениеЗаполнено(СтрокаНастройки.Категория) Тогда
			Возврат СтрокаНастройки.Приоритет; 
		КонецЕсли;  
		
		ЦКГСоответствуетУсловию 	  = Истина;
		КатегорияСоответствуетУсловию = Истина;
		
		ЦКГСвойство 	  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаНастройки.ЦКГ,"Владелец");
		КатегорияСвойство = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаНастройки.Категория,"Владелец"); 
		
		Если ЗначениеЗаполнено(СтрокаНастройки.ЦКГ) Тогда
			ЦКГПартнера = УправлениеСвойствами.ЗначениеСвойства(Партнер, ЦКГСвойство);
			ЦКГСоответствуетУсловию = (ЦКГПартнера = СтрокаНастройки.ЦКГ);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаНастройки.Категория) Тогда
			КатегорияПартнера = УправлениеСвойствами.ЗначениеСвойства(Партнер, КатегорияСвойство);
	        КатегорияСоответствуетУсловию = (КатегорияПартнера = СтрокаНастройки.Категория);
		КонецЕсли;
		
		Если ЦКГСоответствуетУсловию И КатегорияСоответствуетУсловию Тогда
			Возврат	СтрокаНастройки.Приоритет;	
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Неопределено;
	
КонецФункции
